import aiohttp
import asyncio
from termcolor import colored

# عرض الرسومات الترحيبية
print("""
 ______   ________  ____  _____       _       ______   ________  ________   ______   
|_   _ \ |_   __  ||_   \|_   _|     / \     |_   _ \ |_   __  ||_   __  |.' ____ \  
  | |_) |  | |_ \_|  |   \ | |      / _ \      | |_) |  | |_ \_|  | |_ \_|| (___ \_| 
  |  __'.  |  _| _   | |\ \| |     / ___ \     |  __'.  |  _| _   |  _| _  _.____`.  
 _| |__) |_| |__/ | _| |_\   |_  _/ /   \ \_  _| |__) |_| |__/ | _| |__/ || \____) | 
|_______/|________||_____|\____||____| |____||_______/|________||________| \______.' 
                                                                                     
""")
print("""
      _       ____  ____  ____    ____  ________  ______    
     / \     |_   ||   _||_   \  /   _||_   __  ||_   _ `.  
    / _ \      | |__| |    |   \/   |    | |_ \_|  | | `. \ 
   / ___ \     |  __  |    | |\  /| |    |  _| _   | |  | | 
 _/ /   \ \_  _| |  | |_  _| |_\/_| |_  _| |__/ | _| |_.' / 
|____| |____||____||____||_____||_____||________||______.'  
                                                            
""")
print("""
 ____  ____     _        ______  _____  ____  _____  ________  
|_  _||_  _|   / \     .' ___  ||_   _||_   \|_   _||_   __  | 
  \ \  / /    / _ \   / .'   \_|  | |    |   \ | |    | |_ \_| 
   \ \/ /    / ___ \  | |         | |    | |\ \| |    |  _| _  
   _|  |_  _/ /   \ \_\ `.___.'\ _| |_  _| |_\   |_  _| |__/ | 
  |______||____| |____|`.____ .'|_____||_____|\____||________| 
                                                               
""")
print("""
                                                                                                 
____    __    ____  _______ .______           _______  __  .______       __  .__   __.   _______ 
\   \  /  \  /   / |   ____||   _  \         |   ____||  | |   _  \     |  | |  \ |  |  /  _____|
 \   \/    \/   /  |  |__   |  |_)  |  ______|  |__   |  | |  |_)  |    |  | |   \|  | |  |  __  
  \            /   |   __|  |   _  <  |______|   __|  |  | |      /     |  | |  . `  | |  | |_ | 
   \    /\    /    |  |____ |  |_)  |        |  |     |  | |  |\  \----.|  | |  |\   | |  |__| | 
    \__/  \__/     |_______||______/         |__|     |__| | _| `._____||__| |__| \__|  \______| 
                                                                                                 
""")

# يطلب من المستخدم إدخال الرابط الأساسي
base_url = input("Please enter the base URL (e.g., https://example.com/): ")

# فتح ملف common.txt وقراءة الكلمات
with open("common.txt", "r") as file:
    words = [word.strip() for word in file]

# وظيفة للتحقق من صحة كل رابط بشكل غير متزامن
async def check_url(session, word):
    test_url = f"{base_url}{word}"
    try:
        # إرسال طلب HTTP GET إلى الرابط مع مهلة
        async with session.get(test_url, timeout=5) as response:
            if response.status == 200:
                print(colored(f"Valid URL: {test_url}", "green"))
            else:
                print(colored(f"Invalid URL: {test_url}", "red"))
    except:
        print(colored(f"Invalid URL: {test_url}", "red"))

# وظيفة رئيسية لتنفيذ جميع الطلبات بشكل غير متزامن
async def main():
    async with aiohttp.ClientSession() as session:
        tasks = [check_url(session, word) for word in words]
        await asyncio.gather(*tasks)

# تشغيل البرنامج باستخدام asyncio
asyncio.run(main())
